# SystemsAnalysisOptions Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
SystemsAnalysisOptions Constructor
SystemsAnalysisOptions Class See Also
---
Constructs a new instance of the options.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020.1
# Syntax
C#
---
```text
public SystemsAnalysisOptions()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
SystemsAnalysisOptions()
```

# See Also
SystemsAnalysisOptions Class
Autodesk.Revit.DB.Analysis Namespace